import Position from "./position.js";


const BOOK = {
	"千日手": {
		bPieces: [[23,9],[95,8]],
		wPieces: [[11,6],[12,5],[21,8],[22,4],[31,7],[32,7]],
		bHandPieces: [0,0,0,1,0,0,0],
		wHandPieces: [0,0,0,1,0,0,0],
	},
	"連続王手の千日手": {
		bPieces: [[27,15],[37,9],[68,4],[95,8]],
		wPieces: [[19,6],[24,1],[38,7],[39,8],[49,7]],
		bHandPieces: [0,0,0,0,0,0,0],
		wHandPieces: [0,0,0,0,0,0,0],
	},
	"打ち歩詰め": {
		bPieces: [[68,3],[95,8]],
		wPieces: [[38,4],[39,7],[47,7],[48,7],[49,8]],
		bHandPieces: [0,0,0,0,0,0,1],
		wHandPieces: [0,0,0,0,0,0,0],
	},
	"打ち歩詰めじゃない": {
		bPieces: [[68,3],[78,5],[95,8]],
		wPieces: [[38,7],[39,7],[47,7],[48,4],[49,8]],
		bHandPieces: [0,0,0,0,0,0,1],
		wHandPieces: [0,0,0,0,0,0,0],
	},
	"最多合法手": {
		bPieces: [[11,1],[23,8],[25,4],[27,4],[28,4],[35,2],[92,6],[94,6],[96,6]],
		wPieces: [[29,8]],
		bHandPieces: [1,1,1,1,1,1,1],
		wHandPieces: [0,0,3,0,3,0,17],
	},
	"先後同型": {
		bPieces: [[58,7],[61,7],[63,7],[64,7],[65,4],[66,7],[67,7],[69,7],[72,7],[73,4],[75,7],[77,5],[83,3],[85,3],[88,1],[91,6],[92,5],[93,8],[99,6]],
		wPieces: [[52,7],[49,7],[47,7],[46,7],[45,4],[44,7],[43,7],[41,7],[38,7],[37,4],[35,7],[33,5],[27,3],[25,3],[22,1],[19,6],[18,5],[17,8],[11,6]],
		bHandPieces: [0,1,0,0,0,0,0],
		wHandPieces: [0,1,0,0,0,0,0],
	},
	"次の一手1.1": {
		bPieces: [[54,7],[61,7],[65,7],[72,7],[73,2],[75,4],[76,7],[77,7],[78,7],[79,7],[83,1],[85,3],[87,4],[88,8],[91,6],[92,5],[96,3],[98,5],[99,6]],
		wPieces: [[11,6],[12,5],[16,3],[18,5],[19,6],[23,1],[24,4],[25,3],[27,8],[32,7],[34,7],[35,2],[36,7],[37,4],[38,7],[39,7],[41,7],[45,7],[47,7]],
		bHandPieces: [0,0,0,0,0,0,1],
		wHandPieces: [0,0,0,0,0,0,1],
	},
	"次の一手1.54": {
		bPieces: [[27,10],[49,7],[57,1],[67,4],[71,7],[72,7],[74,7],[75,7],[77,7],[82,8],[91,6],[98,5]],
		wPieces: [[11,6],[18,5],[19,6],[23,3],[29,8],[31,7],[35,7],[38,7],[53,4],[54,7],[63,5],[95,3]],
		bHandPieces: [1,1,2,0,1,1,3],
		wHandPieces: [0,0,0,2,0,0,5],
	},
	"次の一手2.10": {
		bPieces: [[16,15],[47,7],[63,7],[64,7],[65,7],[66,7],[68,7],[69,7],[72,7],[73,4],[75,4],[81,7],[82,8],[83,3],[92,5],[98,5],[99,6]],
		wPieces: [[12,5],[18,5],[19,6],[21,1],[25,3],[27,4],[28,8],[31,6],[34,7],[36,3],[38,7],[43,7],[46,7],[49,7],[52,7],[61,7],[97,9]],
		bHandPieces: [0,1,1,0,0,1,0],
		wHandPieces: [0,1,0,1,0,0,1],
	},
	"難問次の一手": {
		bPieces: [[36,1],[56,3],[58,7],[63,7],[66,7],[71,7],[72,7],[74,7],[82,8],[83,3],[91,6],[92,5]],
		wPieces: [[11,6],[12,5],[16,3],[18,5],[25,4],[28,8],[38,7],[41,7],[42,7],[43,7],[45,7],[47,7],[49,6],[54,7],[75,13],[99,9]],
		bHandPieces: [0,2,0,1,0,0,0],
		wHandPieces: [0,0,1,2,0,1,5],
	},
};


export var list = Object.keys(BOOK);


export function getPosition(id) {
	var bPieces = BOOK[id].bPieces, wPieces = BOOK[id].wPieces,
	bHandPieces = BOOK[id].bHandPieces, wHandPieces = BOOK[id].wHandPieces;
	var position = new Position();
	for (var y = 0; y < 9; ++y)
		for (var x = 0; x < 9; ++x)
			position.board[11 + 10 * y + x] = 0;
	for (var piece of bPieces) {
		position.board[piece[0]] = piece[1] | 0b010000;
		if (piece[1] === 0b1000)
			position.bKing = piece[0];
	}
	for (var piece of wPieces) {
		position.board[piece[0]] = piece[1] | 0b100000;
		if (piece[1] === 0b1000)
			position.wKing = piece[0];
	}
	for (var i in bHandPieces)
		position.bPieces[i] = bHandPieces[i];
	for (var i in wHandPieces)
		position.wPieces[i] = wHandPieces[i];

	position.check = position.inCheck();
	return position;
}
